pmorgantech/WaveX/firmware/esp32/components/ui/components/file_browser.cpp
    if (browser->container) {
        // Page destruction should be called from LVGL context
        lv_obj_del(browser->container);
    }

    free(browser);
    ESP_LOGI(TAG, "File browser destroyed");
}

bool wavex_file_browser_navigate_to(wavex_file_browser_t* browser, const char* path) {
    if (!browser || !path)
        return false;

    strncpy(browser->current_path, path, sizeof(browser->current_path) - 1);
    browser->current_path[sizeof(browser->current_path) - 1] = '\0';

    // Mark path update as pending (navigation may be called from non-LVGL context)
    browser_set_ui_update(browser);
    wavex_ui_mark_content_changed();

    // Reset scroll position and selection when navigating
    browser->first_visible_index = 0;
    browser->selected_index = 0;

    // Refresh file list
    bool success = refresh_file_list(browser);

    // Notify directory changed callback
    if (success && browser->dir_changed_cb) {
        browser->dir_changed_cb(browser->current_path, browser->user_data);
    }

    return success;
}

bool wavex_file_browser_navigate_up(wavex_file_browser_t* browser) {
    if (!browser)
        return false;

    // Check if we're already at root directory
    if (strcmp(browser->current_path, "/") == 0) {
        ESP_LOGI(TAG, "Already at root directory, cannot navigate up");
        return false;
    }

    // Construct parent path without modifying current_path
    char parent_path[96];
    strncpy(parent_path, browser->current_path, sizeof(parent_path) - 1);
    parent_path[sizeof(parent_path) - 1] = '\0';

    // Find last directory separator
    char* last_slash = strrchr(parent_path, '/');
    if (last_slash && last_slash != parent_path) {
        *last_slash = '\0';
    } else {
        strcpy(parent_path, "/");
    }

    ESP_LOGI(TAG, "Navigating up: '%s' -> '%s'", browser->current_path, parent_path);

    return wavex_file_browser_navigate_to(browser, parent_path);
}

bool wavex_file_browser_refresh(wavex_file_browser_t* browser) {
    if (!browser)
        return false;

    return refresh_file_list(browser);
}

void wavex_file_browser_set_selection(wavex_file_browser_t* browser, uint32_t index) {
    if (!browser || index >= browser->entry_count)
        return;

    browser->selected_index = index;

    // Update viewport to ensure selected entry is visible
    uint32_t prev_first_visible = browser->first_visible_index;
    if (browser->selected_index < browser->first_visible_index) {
        browser->first_visible_index = browser->selected_index;
    } else {
        uint32_t last_visible_index = browser->first_visible_index + browser->visible_count - 1;
        if (browser->selected_index > last_visible_index) {
            browser->first_visible_index = browser->selected_index - (browser->visible_count - 1);
            if (browser->first_visible_index > browser->selected_index) {
                browser->first_visible_index = 0;
            }
        }
    }

    ESP_LOGD(TAG, "Selected entry %d: %s", index, browser->entries[index].name);

    // Mark the update as pending (selection may be changed from non-LVGL
    // context): full rebuild if the viewport scrolled, highlight-only if not.
    if (browser->first_visible_index != prev_first_visible) {
        browser_set_ui_update(browser);
    } else {
        browser_set_selection_update(browser);
    }
    wavex_ui_mark_content_changed();
}

const wavex_file_entry_t* wavex_file_browser_get_selected(wavex_file_browser_t* browser) {
    if (!browser || browser->selected_index >= browser->entry_count)
        return NULL;

    return &browser->entries[browser->selected_index];
}

uint32_t wavex_file_browser_get_selected_index(wavex_file_browser_t* browser) {
    if (!browser)
        return 0;

    return browser->selected_index;
}

// Navigate selection up with boundary checking and scrolling
bool wavex_file_browser_navigate_up_entry(wavex_file_browser_t* browser) {
    if (!browser || browser->entry_count == 0) {
        ESP_LOGD(TAG, "navigate_up: Invalid browser or no entries");
        return false;
    }

    // If already at first entry, do nothing (no wrap-around)
    if (browser->selected_index == 0) {
        ESP_LOGD(TAG, "navigate_up: Already at first entry (index 0)");
        return false;
    }

    uint32_t new_index = browser->selected_index - 1;
    browser->selected_index = new_index;
    ESP_LOGD(TAG, "navigate_up: moved from %u to %u", browser->selected_index + 1, new_index);

    // Update viewport if selection moved above visible area
    bool viewport_moved = false;
    if (browser->selected_index < browser->first_visible_index) {
        browser->first_visible_index = browser->selected_index;
        viewport_moved = true;
        ESP_LOGD(TAG, "navigate_up: scrolled viewport to %u", browser->first_visible_index);
    }

    // Notify callback about selection change
    if (browser->file_selected_index_cb && browser->entries) {
        browser->file_selected_index_cb(browser->selected_index,
                                        &browser->entries[browser->selected_index],
                                        browser->user_data);
    }

    // Full rebuild only when the viewport scrolled; otherwise just move the
    // highlight.
    if (viewport_moved) {
        browser_set_ui_update(browser);
    } else {
        browser_set_selection_update(browser);
    }
    wavex_ui_mark_content_changed();

    return true;
}

// Navigate selection down with boundary checking and scrolling
bool wavex_file_browser_navigate_down_entry(wavex_file_browser_t* browser) {
    if (!browser || browser->entry_count == 0) {
        ESP_LOGD(TAG, "navigate_down: Invalid browser or no entries");
        return false;
    }

    uint32_t last_index = browser->entry_count - 1;

    // If already at last entry, do nothing (no wrap-around)
    if (browser->selected_index >= last_index) {
        ESP_LOGD(TAG, "navigate_down: Already at last entry (index %u)", browser->selected_index);
        return false;
    }

    uint32_t new_index = browser->selected_index + 1;
    browser->selected_index = new_index;
    ESP_LOGD(TAG, "navigate_down: moved from %u to %u", browser->selected_index - 1, new_index);

    // Update viewport if selection moved below visible area
    bool viewport_moved = false;
    uint32_t last_visible_index = browser->first_visible_index + browser->visible_count - 1;
    if (browser->selected_index > last_visible_index) {
        // Scroll down to show the selected entry
        browser->first_visible_index = browser->selected_index - (browser->visible_count - 1);
        // Ensure first_visible_index doesn't go negative (unsigned will wrap, so check bounds)
        if (browser->first_visible_index > browser->selected_index) {
            browser->first_visible_index = 0;
        }
        viewport_moved = true;
        ESP_LOGD(TAG, "navigate_down: scrolled viewport to %u", browser->first_visible_index);
    }

