pmorgantech/WaveX/firmware/esp32/components/ui/components/file_browser.cpp
    // Notify callback about selection change
    if (browser->file_selected_index_cb && browser->entries) {
        browser->file_selected_index_cb(browser->selected_index,
                                        &browser->entries[browser->selected_index],
                                        browser->user_data);
    }

    // Full rebuild only when the viewport scrolled; otherwise just move the
    // highlight.
    if (viewport_moved) {
        browser_set_ui_update(browser);
    } else {
        browser_set_selection_update(browser);
    }
    wavex_ui_mark_content_changed();

    return true;
}

void wavex_file_browser_set_file_selected_callback(wavex_file_browser_t* browser,
                                                   wavex_file_selected_cb_t callback,
                                                   void* user_data) {
    if (!browser)
        return;

    browser->file_selected_cb = callback;
    browser->user_data = user_data;
}

void wavex_file_browser_set_file_selected_index_callback(wavex_file_browser_t* browser,
                                                         wavex_file_selected_index_cb_t callback,
                                                         void* user_data) {
    if (!browser)
        return;

    browser->file_selected_index_cb = callback;
    browser->user_data = user_data;
}

void wavex_file_browser_set_directory_changed_callback(wavex_file_browser_t* browser,
                                                       wavex_directory_changed_cb_t callback,
                                                       void* user_data) {
    if (!browser)
        return;

    browser->dir_changed_cb = callback;
    browser->user_data = user_data;
}

const char* wavex_file_browser_get_current_path(wavex_file_browser_t* browser) {
    if (!browser)
        return NULL;

    return browser->current_path;
}

uint32_t wavex_file_browser_get_entry_count(wavex_file_browser_t* browser) {
    if (!browser)
        return 0;

    return browser->entry_count;
}

const wavex_file_entry_t* wavex_file_browser_get_entry(wavex_file_browser_t* browser,
                                                       uint32_t index) {
    if (!browser || index >= browser->entry_count)
        return NULL;

    return &browser->entries[index];
}

// File list event callback
static void file_list_event_cb(lv_event_t* e) {
    lv_event_code_t code = lv_event_get_code(e);
    wavex_file_browser_t* browser = (wavex_file_browser_t*)lv_event_get_user_data(e);

    if (code == LV_EVENT_CLICKED) {
        // lv_event_get_current_target returns the object the callback was attached to (the list)
        // lv_event_get_target returns the actual object that was clicked (the button)
        lv_obj_t* list = (lv_obj_t*)lv_event_get_current_target(e);
        lv_obj_t* btn = (lv_obj_t*)lv_event_get_target(e);

        // Find the button index by iterating through the list
        uint32_t ui_index = 0;
        lv_obj_t* child = lv_obj_get_child(list, 0);
        while (child && child != btn) {
            child = lv_obj_get_child(list, ui_index + 1);
            ui_index++;
        }

        // Handle ".." entries that come from Daisy
        uint32_t entry_index = ui_index;

        if (entry_index < browser->entry_count) {
            const wavex_file_entry_t* entry = &browser->entries[entry_index];
            if (strcmp(entry->name, "..") == 0) {
                // ".." entry clicked - navigate up
                ESP_LOGI(TAG, "Parent directory entry clicked");
                wavex_file_browser_navigate_up(browser);
                return;
            }
        }

        if (entry_index < browser->entry_count) {
            wavex_file_browser_set_selection(browser, entry_index);

            // If it's a directory, navigate into it
            if (browser->entries[entry_index].is_directory) {
                char new_path[256];
                // Avoid double slashes when constructing directory path
                if (strcmp(browser->current_path, "/") == 0) {
                    snprintf(new_path, sizeof(new_path), "/%s", browser->entries[entry_index].name);
                } else {
                    snprintf(new_path,
                             sizeof(new_path),
                             "%s/%s",
                             browser->current_path,
                             browser->entries[entry_index].name);
                }
                ESP_LOGD(TAG,
                         "Directory navigation: current='%s', name='%s' -> new_path='%s'",
                         browser->current_path,
                         browser->entries[entry_index].name,
                         new_path);
                wavex_file_browser_navigate_to(browser, new_path);
            } else {
                // File selected - notify callback with index
                ESP_LOGI(TAG,
                         "File selected: %s, index=%d",
                         browser->entries[entry_index].name,
                         entry_index);

                if (browser->file_selected_index_cb) {
                    browser->file_selected_index_cb(
                        entry_index, &browser->entries[entry_index], browser->user_data);
                } else {
                    ESP_LOGW(TAG, "No callback set for file selection");
                }
            }
        }
    }
}

// Refresh file list by requesting directory contents from Daisy
static bool refresh_file_list(wavex_file_browser_t* browser) {
    if (!browser)
        return false;

    ESP_LOGI(TAG, "refresh_file_list called for path: %s", browser->current_path);

    // Reset pagination state
    browser->total_files = 0;
    browser->current_page = 0;
    browser->pagination_in_progress = true;
    browser->loaded_entries = 0;
    browser->entry_count = 0;

    // Mark UI update as pending (will clear list when processed in UI task)
    browser_set_ui_update(browser);
    wavex_ui_mark_content_changed();

    // Send first browse request (page 0)
    if (!send_browse_request(browser->config.comm_interface, browser->current_path, 0)) {
        ESP_LOGE(TAG, "Failed to send browse request");
        browser->pagination_in_progress = false;
        // Mark error state for deferred UI update
        browser->entry_count = 0;
        browser_set_ui_update(browser);
        wavex_ui_mark_content_changed();
        return false;
    } else {
        ESP_LOGI(TAG, "Sent browse request for page 0, waiting for response...");
        return true;
    }
}

// Parse browse response from Daisy using payload format (not full packet)
static bool parse_browse_response(const uint8_t* data,
                                  size_t length,
                                  wavex_file_entry_t* entries,
                                  uint32_t* count) {
    if (!data || length < sizeof(BrowseRespHeader)) {
        ESP_LOGE(TAG,
                 "Browse response payload too short: %d bytes (need at least %d)",
                 (int)length,
                 (int)sizeof(BrowseRespHeader));
        *count = 0;
        return false;
    }

