pmorgantech/WaveX/firmware/esp32/components/ui/components/file_browser.cpp
    // Parse payload directly: BrowseRespHeader + FileEntryWire entries
    const BrowseRespHeader* browse_header = (const BrowseRespHeader*)data;
    uint32_t total_count = browse_header->total_count;
    uint8_t n_entries = browse_header->n;

    ESP_LOGI(TAG,
             "Browse response: total_count=%lu, n_entries=%u",
             (unsigned long)total_count,
             n_entries);

    // Debug: Show raw payload data
    ESP_LOGI(TAG, "Raw payload (first 64 bytes):");
    for (int i = 0; i < 64 && i < (int)length; i++) {
        if (i % 16 == 0)
            ESP_LOGI(TAG, "");
        ESP_LOGI(TAG, "%02X ", data[i]);
    }
    ESP_LOGI(TAG, "");

    // Validate we have enough data for the header + entries
    size_t expected_size = sizeof(BrowseRespHeader) + (n_entries * sizeof(FileEntryWire));
    if (length < expected_size) {
        ESP_LOGE(TAG,
                 "Browse response payload too short: got %d bytes, expected %d",
                 (int)length,
                 (int)expected_size);
        *count = 0;
        return false;
    }

    // Parse file entries
    uint32_t parsed_count = 0;
    const FileEntryWire* wire_entries = (const FileEntryWire*)(data + sizeof(BrowseRespHeader));

    ESP_LOGI(TAG, "Starting file entry parsing: n_entries=%u, max_count=%u", n_entries, *count);

    for (uint8_t i = 0; i < n_entries && parsed_count < *count; i++) {
        const FileEntryWire* wire = &wire_entries[i];

        ESP_LOGI(TAG,
                 "Parsing entry %d: is_dir=%d, size=%lu, name='%.50s'",
                 i,
                 wire->is_dir,
                 (unsigned long)wire->size_bytes,
                 wire->name);

        // Copy to our file entry structure
        wavex_file_entry_t* entry = &entries[parsed_count++];
        entry->is_directory = wire->is_dir != 0;
        entry->size_bytes = wire->size_bytes;
        strncpy(entry->name, wire->name, sizeof(entry->name) - 1);
        entry->name[sizeof(entry->name) - 1] = '\0';

        // Create full path - for now just use the name, full path will be constructed when needed
        strncpy(entry->path, entry->name, sizeof(entry->path) - 1);
        entry->path[sizeof(entry->path) - 1] = '\0';

        ESP_LOGI(TAG,
                 "Parsed entry %d: '%s' (%s) - %lu bytes",
                 i,
                 entry->name,
                 entry->is_directory ? "DIR" : "FILE",
                 (unsigned long)entry->size_bytes);
    }

    *count = parsed_count;
    return true;
}

// Parse browse response with pagination information using payload format
static bool parse_browse_response_with_pagination(const uint8_t* data,
                                                  size_t length,
                                                  wavex_file_entry_t* entries,
                                                  uint32_t* count,
                                                  uint32_t* total_files,
                                                  uint8_t* current_page_entries,
                                                  const char* current_path) {
    if (!data || length < sizeof(BrowseRespHeader)) {
        ESP_LOGE(TAG,
                 "Browse response payload too short: %d bytes (need at least %d)",
                 (int)length,
                 (int)sizeof(BrowseRespHeader));
        *count = 0;
        *total_files = 0;
        *current_page_entries = 0;
        return false;
    }

    ESP_LOGI(TAG, "Parsing browse response payload: %d bytes", (int)length);

    // Parse payload directly: BrowseRespHeader + FileEntryWire entries
    const BrowseRespHeader* browse_header = (const BrowseRespHeader*)data;
    *total_files = browse_header->total_count;
    *current_page_entries = browse_header->n;

    ESP_LOGI(TAG,
             "Browse response: total_count=%lu, n_entries=%u",
             (unsigned long)*total_files,
             *current_page_entries);

    // Validate we have enough data for the header + entries
    size_t expected_size =
        sizeof(BrowseRespHeader) + (*current_page_entries * sizeof(FileEntryWire));
    if (length < expected_size) {
        ESP_LOGE(TAG,
                 "Browse response payload too short: got %d bytes, expected %d",
                 (int)length,
                 (int)expected_size);
        *count = 0;
        *total_files = 0;
        *current_page_entries = 0;
        return false;
    }

    // Parse file entries
    uint32_t parsed_count = 0;
    const FileEntryWire* wire_entries = (const FileEntryWire*)(data + sizeof(BrowseRespHeader));

    ESP_LOGI(TAG,
             "Starting file entry parsing: n_entries=%u, max_count=%u",
             *current_page_entries,
             *count);

    for (uint8_t i = 0; i < *current_page_entries && parsed_count < *count; i++) {
        const FileEntryWire* wire_entry = &wire_entries[i];
        wavex_file_entry_t* entry = &entries[parsed_count];

        entry->is_directory = wire_entry->is_dir != 0;
        entry->size_bytes = wire_entry->size_bytes;

        // Copy WAV metadata
        entry->sample_rate = wire_entry->sample_rate;
        entry->channels = wire_entry->channels;
        entry->bits_per_sample = wire_entry->bits_per_sample;
        entry->duration_ms = wire_entry->duration_ms;

        // Copy name with null termination
        strncpy(entry->name, wire_entry->name, sizeof(entry->name) - 1);
        entry->name[sizeof(entry->name) - 1] = '\0';

        // Strip leading slash if present (Daisy sometimes includes it)
        if (entry->name[0] == '/') {
            memmove(entry->name, entry->name + 1, strlen(entry->name));
        }

        ESP_LOGD(TAG,
                 "Entry %d: Raw name from Daisy: '%s', after slash strip: '%s'",
                 i,
                 wire_entry->name,
                 entry->name);

        // Build full path with bounds checking
        const char* path_base = current_path ? current_path : "/";

        ESP_LOGD(TAG, "Entry %d: current_path='%s', entry->name='%s'", i, path_base, entry->name);

        // Ensure we don't have double slashes - remove trailing slash from current_path if present
        const char* base_path = path_base;
        if (strlen(path_base) > 1 && path_base[strlen(path_base) - 1] == '/') {
            // Create a temporary string without trailing slash
            static char temp_path[96];
            strncpy(temp_path, path_base, sizeof(temp_path) - 1);
            temp_path[sizeof(temp_path) - 1] = '\0';
            temp_path[strlen(temp_path) - 1] = '\0';  // Remove trailing slash
            base_path = temp_path;
        }

        // Special case: if base_path is "/" and entry->name starts with "/", avoid double slash
        int path_len;
        if (strcmp(base_path, "/") == 0 && entry->name[0] == '/') {
            path_len = snprintf(entry->path, sizeof(entry->path), "%s", entry->name);
            ESP_LOGD(TAG,
                     "Path construction (root case): base='%s', name='%s' -> path='%s'",
                     base_path,
                     entry->name,
                     entry->path);
        } else {
            path_len = snprintf(entry->path, sizeof(entry->path), "%s/%s", base_path, entry->name);
            ESP_LOGD(TAG,
                     "Path construction (normal case): base='%s', name='%s' -> path='%s'",
                     base_path,
                     entry->name,
                     entry->path);
        }
        if (path_len >= (int)sizeof(entry->path)) {
            // Path was truncated, ensure null termination
            entry->path[sizeof(entry->path) - 1] = '\0';
            ESP_LOGW(TAG, "Path truncated for entry: %s", entry->name);
        }

        parsed_count++;

