pmorgantech/WaveX/firmware/esp32/components/ui/components/file_browser.cpp
        ESP_LOGI(TAG,
                 "Parsed entry %d: '%s' (%s) - %lu bytes",
                 i,
                 entry->name,
                 entry->is_directory ? "DIR" : "FILE",
                 (unsigned long)entry->size_bytes);
    }

    *count = parsed_count;
    return true;
}

// Send browse request to Daisy via comm interface
static bool send_browse_request(WaveX::Comm::ICommInterface* comm_interface,
                                const char* path,
                                uint8_t start_index) {
    if (!comm_interface) {
        ESP_LOGE(TAG, "No comm interface available for browse request");
        return false;
    }

    esp_err_t result = comm_interface->sendBrowseRequest(path, start_index);
    if (result != ESP_OK) {
        ESP_LOGE(TAG, "Failed to send browse request: %d", result);
        return false;
    }
    ESP_LOGI(
        TAG,
        "=== INTERFACE MESSAGE: Successfully sent browse request for path: %s, start_index: %d ===",
        path,
        start_index);
    return true;
}

// Browse response callback function
static void browse_resp_callback(const uint8_t* data, size_t length, void* user_data) {
    wavex_file_browser_t* browser = (wavex_file_browser_t*)user_data;
    if (!browser || !data || length == 0) {
        ESP_LOGE(TAG, "Invalid browse response callback parameters");
        return;
    }

    ESP_LOGI(TAG, "Received browse response: %d bytes", (int)length);

    // Parse the browse response to get total count and current page entries
    // Allocate on heap instead of stack to prevent stack overflow in uart_link task
    // Each entry is ~152 bytes, so 20 entries = ~3040 bytes - too large for task stack
    wavex_file_entry_t* temp_entries = (wavex_file_entry_t*)malloc(20 * sizeof(wavex_file_entry_t));
    if (!temp_entries) {
        ESP_LOGE(TAG, "Failed to allocate memory for browse response parsing");
        browser->pagination_in_progress = false;
        return;
    }

    uint32_t temp_count = 20;
    uint32_t total_files = 0;
    uint8_t current_page_entries = 0;

    bool parse_success = parse_browse_response_with_pagination(data,
                                                               length,
                                                               temp_entries,
                                                               &temp_count,
                                                               &total_files,
                                                               &current_page_entries,
                                                               browser->current_path);

    if (!parse_success) {
        free(temp_entries);
        ESP_LOGE(TAG, "Failed to parse browse response");
        browser->pagination_in_progress = false;
        // Mark error state for deferred UI update (this callback runs from UART task, not LVGL
        // context)
        browser->entry_count = 0;
        browser_set_ui_update(browser);
        wavex_ui_mark_content_changed();
        return;
    }

    // An empty listing is authoritative, and it can arrive UNSOLICITED: the
    // Daisy sends one when the card is ejected or becomes unreadable. The
    // accumulate path below cannot express it - loaded_entries is only reset
    // by refresh_file_list(), so an unsolicited response would re-adopt the
    // stale count and leave the old files on screen, and if current_page were
    // non-zero it would not even mark a UI update. Handle it directly.
    if (total_files == 0 && current_page_entries == 0) {
        free(temp_entries);
        ESP_LOGI(TAG, "Empty browse response - clearing file list");
        browser->total_files = 0;
        browser->loaded_entries = 0;
        browser->entry_count = 0;
        browser->current_page = 0;
        browser->first_visible_index = 0;
        browser->selected_index = 0;
        browser->pagination_in_progress = false;
        browser_set_ui_update(browser);
        wavex_ui_mark_content_changed();
        return;
    }

    // Update browser state
    if (browser->current_page == 0) {
        // First page - initialize total count
        browser->total_files = total_files;
        ESP_LOGI(TAG, "Total files in directory: %d", total_files);
    }

    // Add current page entries to the browser's entry array
    // Sort ".." entries to the top if present (only on first page, and only if not at root)
    uint32_t start_index = browser->loaded_entries;
    uint32_t parent_dir_index = 0xFFFFFFFF;  // Track where ".." is found (using max value)

    // First pass: find ".." entry position if on first page and not at root
    if (browser->current_page == 0 && strcmp(browser->current_path, "/") != 0) {
        for (uint32_t i = 0; i < current_page_entries; i++) {
            if (strcmp(temp_entries[i].name, "..") == 0) {
                parent_dir_index = i;
                break;
            }
        }
    }

    // Second pass: add entries, putting ".." first if found on first page
    uint32_t write_index = start_index;

    // If ".." was found on first page and we're not at root, put it first
    if (parent_dir_index != 0xFFFFFFFF && browser->current_page == 0 &&
        strcmp(browser->current_path, "/") != 0 && write_index < browser->config.max_entries) {
        browser->entries[write_index] = temp_entries[parent_dir_index];
        browser->loaded_entries++;
        write_index++;
    }

    // Add all other entries (skip ".." if already added at the top)
    for (uint32_t i = 0; i < current_page_entries && write_index < browser->config.max_entries;
         i++) {
        if (parent_dir_index != 0xFFFFFFFF && i == parent_dir_index) {
            continue;  // Skip ".." if already added at the top
        }
        browser->entries[write_index] = temp_entries[i];
        browser->loaded_entries++;
        write_index++;
    }

    ESP_LOGI(TAG,
             "Loaded page %d: %d entries, total loaded: %d/%d",
             browser->current_page,
             current_page_entries,
             browser->loaded_entries,
             browser->total_files);

