pmorgantech/WaveX/firmware/esp32/components/ui/components/file_browser.cpp
        // Ensure selected_index is within bounds
        if (browser->selected_index >= browser->entry_count) {
            browser->selected_index = 0;
        }

        ESP_LOGI(TAG, "Pagination complete: loaded %d entries", browser->entry_count);

        // Mark UI update as pending (only if not first page)
        if (browser->current_page > 0) {
            browser_set_ui_update(browser);
            wavex_ui_mark_content_changed();
        }

        // Notify directory changed callback (only if not first page)
        if (browser->current_page > 0 && browser->dir_changed_cb) {
            browser->dir_changed_cb(browser->current_path, browser->user_data);
        }
    }
}

// Thread-safe function to process pending UI updates (called from UI task with LVGL lock)
void wavex_file_browser_process_pending_updates(wavex_file_browser_t* browser) {
    if (!browser) {
        ESP_LOGE(TAG, "process_pending_updates: browser is NULL!");
        return;
    }

    // Acquire-load pairs with browser_set_ui_update's release-store: once we
    // see the flag, the UART task's writes to entries[]/entry_count are
    // guaranteed visible (review Finding 11).
    bool full = browser_ui_update_pending(browser);
    bool selection_only = browser_selection_update_pending(browser);
    if (!full && !selection_only) {
        return;  // No update needed
    }

    if (full) {
        ESP_LOGD(TAG,
                 "Processing pending UI update for file browser with %d entries",
                 browser->entry_count);
        // A rebuild ends with update_visual_selection, so it satisfies any
        // concurrent highlight request too.
        browser_clear_ui_update(browser);
        browser_clear_selection_update(browser);

        // Update UI (caller must hold LVGL lock - this is called from UI task loop)
        update_file_browser_ui(browser);
    } else {
        // Selection moved within the current viewport: restyle the existing
        // buttons instead of destroying and recreating them.
        browser_clear_selection_update(browser);
        update_visual_selection(browser);
    }

    ESP_LOGD(TAG, "UI update complete");
}

// Helper function to update the file browser UI
// NOTE: Must be called with LVGL lock already held (from UI task loop)
static void update_file_browser_ui(wavex_file_browser_t* browser) {
    if (!browser || !browser->list)
        return;

    // LVGL lock must be held by caller (UI task loop)
    // Update path label if needed
    if (browser->path_label) {
        lv_label_set_text(browser->path_label, browser->current_path);
    }

    lv_obj_clean(browser->list);

    if (browser->entry_count > 0 && browser->entries) {
        // Ensure first_visible_index is valid
        if (browser->first_visible_index >= browser->entry_count) {
            browser->first_visible_index = 0;
        }

        // Calculate which entries to display (scrolling viewport)
        uint32_t start_index = browser->first_visible_index;
        uint32_t end_index = start_index + browser->visible_count;
        if (end_index > browser->entry_count) {
            end_index = browser->entry_count;
        }

        // Create list items only for visible entries
        for (uint32_t i = start_index; i < end_index; i++) {
            // Safety check for entry access
            if (!browser->entries[i].name[0]) {
                ESP_LOGW(TAG, "Skipping empty entry at index %d", i);
                continue;
            }

            lv_obj_t* btn = lv_list_add_btn(browser->list, NULL, browser->entries[i].name);
            if (!btn) {
                ESP_LOGE(TAG, "Failed to create button for entry %d", i);
                continue;
            }

            // Apply styling
            ui_theme_apply_button_style(btn, true);

            // Set text color to white and increase font size to 18px
            lv_obj_set_style_text_color(btn, UI_COLOR_TEXT, LV_PART_MAIN);
            lv_obj_set_style_text_font(btn, UI_FONT_TITLE, LV_PART_MAIN);

            // Add directory indicator
            if (browser->entries[i].is_directory) {
                lv_obj_t* label = lv_obj_get_child(btn, 0);
                if (label) {
                    char dir_text[64];
                    snprintf(dir_text, sizeof(dir_text), "[DIR] %s", browser->entries[i].name);
                    lv_label_set_text(label, dir_text);
                }
            }

            // Store the actual entry index in user data for selection highlighting
            lv_obj_set_user_data(btn, (void*)(uintptr_t)i);
        }

        // Update visual selection (maps selected_index to visible button)
        update_visual_selection(browser);

        ESP_LOGD(TAG, "Updated file browser UI with %d entries", browser->entry_count);
    } else if (browser->entry_count == 0 && browser->pagination_in_progress == false) {
        // Show "No files found..." message (pagination complete but no entries)
        lv_obj_t* btn = lv_list_add_btn(browser->list, NULL, "No files found...");
        ui_theme_apply_button_style(btn, false);
        lv_obj_set_style_text_color(btn, UI_COLOR_TEXT, LV_PART_MAIN);
        lv_obj_set_style_text_font(btn, &lv_font_montserrat_18, LV_PART_MAIN);
        ESP_LOGI(TAG, "No files found in directory");
    } else {
        // Error state - show error message (entry_count is 0 but pagination not in progress =
        // error)
        lv_obj_t* btn = lv_list_add_btn(browser->list, NULL, "Error loading files");
        ui_theme_apply_button_style(btn, false);
        lv_obj_set_style_text_color(btn, UI_COLOR_TEXT, LV_PART_MAIN);
        lv_obj_set_style_text_font(btn, &lv_font_montserrat_18, LV_PART_MAIN);
        ESP_LOGI(TAG, "Showing error message in file browser");
    }

    // Mark content as changed to trigger refresh in UI task
    wavex_ui_mark_content_changed();
}

// Helper function to update visual selection highlighting
// NOTE: Must be called with LVGL lock already held
static void update_visual_selection(wavex_file_browser_t* browser) {
    if (!browser || !browser->list)
        return;

    // LVGL lock must be held by caller
    // Get all buttons in the list (these are only the visible ones)
    uint32_t child_count = lv_obj_get_child_cnt(browser->list);

    // Ensure selected_index is within bounds of all entries
    if (browser->selected_index >= browser->entry_count) {
        browser->selected_index = 0;  // Reset to first item if out of bounds
    }

    // Highlight the selected entry if it's visible
    for (uint32_t i = 0; i < child_count; i++) {
        lv_obj_t* btn = lv_obj_get_child(browser->list, i);
        if (btn) {
            // Get the actual entry index from user data
            uint32_t entry_index = (uint32_t)(uintptr_t)lv_obj_get_user_data(btn);

