pmorgantech/WaveX/firmware/esp32/components/ui/components/file_browser.cpp
            if (entry_index == browser->selected_index) {
                // Highlight selected item
                lv_obj_set_style_bg_color(btn, lv_color_make(0x33, 0x66, 0x99), LV_PART_MAIN);
                lv_obj_set_style_border_color(btn, lv_color_make(0x66, 0x99, 0xCC), LV_PART_MAIN);
                lv_obj_set_style_border_width(btn, 2, LV_PART_MAIN);
            } else {
                // Reset to normal style
                lv_obj_set_style_bg_color(btn, lv_color_make(0x22, 0x22, 0x22), LV_PART_MAIN);
                lv_obj_set_style_border_color(btn, lv_color_make(0x44, 0x44, 0x44), LV_PART_MAIN);
                lv_obj_set_style_border_width(btn, 1, LV_PART_MAIN);
            }
        }
    }
    // Mark content as changed to trigger refresh (lock held by caller)
    wavex_ui_mark_content_changed();
}

// Storage appeared or vanished. Runs on the UART task, so it must not touch
// LVGL - refresh_file_list() only sends a browse request and sets the deferred
// UI-update flag, which is safe from here.
static void storage_status_callback(bool mounted, void* user_data) {
    wavex_file_browser_t* browser = (wavex_file_browser_t*)user_data;
    if (!browser) {
        return;
    }
    if (!mounted) {
        // The empty browse response that accompanies a loss already clears the
        // list; nothing to do but stop any pagination still in flight.
        browser->pagination_in_progress = false;
        ESP_LOGI(TAG, "Storage lost - browser idle");
        return;
    }
    ESP_LOGI(TAG, "Storage available - re-listing '%s'", browser->current_path);
    refresh_file_list(browser);
}
